---
type: OpenOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# OpenOptions

`Autodesk.Revit.DB.OpenOptions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | OpenOptions | 2013 | `public OpenOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetOpenWorksetsConfiguration | 2014 | `public WorksetConfiguration GetOpenWorksetsConfiguration ()` |
| Method | SetOpenWorksetsConfiguration | 2014 | `public void SetOpenWorksetsConfiguration ( WorksetConfiguration openConfiguration )` |
| Property | AllowOpeningLocalByWrongUser | 2014 | `public bool AllowOpeningLocalByWrongUser { get ; set ; }` |
| Property | Audit | 2014 | `public bool Audit { get ; set ; }` |
| Property | DetachFromCentralOption | 2013 | `public DetachFromCentralOption DetachFromCentralOption { get ; set ; }` |
| Property | IgnoreExtensibleStorageSchemaConflict | 2022 | `public bool IgnoreExtensibleStorageSchemaConflict { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OpenForeignOption | 2019.2 | `public OpenForeignOption OpenForeignOption { get ; set ; }` |